site1/app/Models/UsuarioModel.php

SELECT *
FROM `usuario`
WHERE `email` = 'glauberbim2018@gmail.com'
 LIMIT 1
---
    public function validar($email,$senha)
    {
        //buscar o email
        $buscaEmail = $this->where('email',$email)->first();